// HELLO DATA
let hello = {
    pic: '/pic/me_.jpg',
    txt1: `Так уж получилось что я фулстек программист с семилетним опытом работы в разных компаниях. Сейчас главный специалист 
        в одном из российских банков. И по моей задумке этот сайт на который Вы сейчас смотрите должен всех сагитировать записаться ко мне на курсы...`,
    txt2: `Набираю команду для обкатки курсов по программированию(я автор). Кратко:
        время 1-ого занятия 1.5 часа. Стоимость 1-ого занятия 300 руб., оплата по занятиям. Т.к. курсы ни на ком не обкатаны, цена занижена. 
        Платите только за те занятия курса, которые Вам нужны! Но будет лучше посещать все уроки из понравившегося этапа. 
        На курсе с Вами от 8-20 человек.`,
    txt3: `Курсы разбиты на этапы(главы). Каждый этап соответствует некоторому уровню знаний. Если Вы по нолям и нечего не знайте,
        Вам лучше записаться с самого начала, и еще можно начать самостоятельно усилено готовится. 
        Если уже есть опыт, Вам можно вписаться в любую понравившуюся главу.
        В курсе используется GIT поэтому можно будет стянуть все наработки проделанные до Вас.
        Программу и учебный материал составлял я исходя из своего опыта и понимания что и как правильно нужно делать. Веду курсы я.
        Когда соберется команда желающих, всех вызвоню, и демократическим путем определим в какое время(после 19 00 по мск) и в какие дни будем заниматься.
        Так же определимся с мессенджером-звонилкой (skype, zoom, discord итд) потестим его и можно будет начинать.
        На уроках мы будем проходить материал в порядке нарастающей сложности, т.е. от простого к сложному. Будет много практики!
        Шаг за шагом будем расширять наше приложение, к конце каждого курса должен будет получится хороший законченный проект в своей области,
        который не стыдно будет показать на собеседовании, и прикрепить к резюме ссылку на него.
        `,
    need: [
        'Желание',
        'Время',
        'Дисциплина (способность сделать домашку и повторить пройденный материал)',
        'Мужество (способность сказать "Я не понял, Ром объясни плз еще раз")',
        'Компьютер / ноутбук',
        'Гарнитура (желательно, но не обязательно)',
    ],
    marquee: `Набираю команду для обкатки курсов по программированию! Нужны упорные и целеустремленные!`,
    myData: {
        name: 'РОМАН',
        // txt1: [
        //     `PHP`,
        //     `JS`,
        //     `C#`
        // ],
        txt1: ` <span class="right-arrow right-arrow-change1">
                   <span>></span>
               </span>35 лет, 7 лет опыта`,
        txt2: `  <span class="right-arrow right-arrow-change1">
                   <span>></span>
               </span>Знает PHP и JS`,
        txt3: `  <span class="right-arrow right-arrow-change1">
                   <span>></span>
               </span>Думает что знает C#, а на самом деле все уже давным давно забыл...`,
       // txt3: ` Каждый день делал 100 отжиманий, 100 приседаний и 100 пресса. Так усердно тренировался что облысел.`,
        active: false
    },
    faq: [
        {
            //<span class="right-arrow">>>></span>
            q: `Как будут проходить занятия?`,
            a: `Группа, смотрит онлайн трансляцию, я подробно объясняю тему от простого к сложному, 
            попутно показываю/пишу/(скидываю в чат) примеры кода для наибольшей наглядности. Отвечаю на вопросы если они 
            возникают. Время от времени прошу повторить по аналогии только самостоятельно, проверяем, показываю как и что
             Вы должны были написать. Если все все усвоили движемся дальше по теме. Когда тема разобрана, сразу же закрепляем 
             на практике, дописывая вместе наш проект`
        },
        {
            q: 'Когда стартует курс?',
            a: `Как только соберу ребят(команду) на курс сразу стартуем.`
        },
        {
            q: 'А чем эти курсы отличаются от курсов известных компаний?',
            a: `Честно, не знаю! Не пользовался курсами известных компаний... 
                Но для моих курсов не придется продавать почки, и кого-то из родственников в рабство т.к. цена у меня на порядки ниже чем 
                <a rel="nofollow" class="description-link" target="_blank" href="https://clck.ru/39AvuT">в известных компаниях</a>. 
                А еще у них сайты "скучные", хотя почти все они предлагают курсы по дизайну...`
        },
        {
            q: 'Домашка будет?',
            a: `Да, будет домашка будет на закрепление полученных знаний и на развитие алгоритмических навыков.`
        },
        {
            q: 'С какой вероятностью я смогу устроится на работу после курсов?',
            a: '50/50. Либо возьмут либо нет.'
        },
        {
            q: 'Какая у меня будет ЗП после курсов?',
            a: 'Не знаю!'
        },
        {
            q: 'Будет сертификат о прохождении курсов?',
            a: 'Нет!'
        },
        {
            q: 'Помощь с трудоустройством?',
            a: `Нет! Но помогу с написанием правильного резюме. И так как я был по обе стороны собеседования расскажу что отвечать 
                когда вы не знаете ответ, и как в целом проходить собеседования.`
        },
        {
            q: 'Что я получу после курсов?',
            a: 'Опыт, знания, навыки которые накопились у меня за 7 лет работы и один хороший проект в портфолио'
        },

    ]
}


// PERC DATA
let perc = [
    {
        pic: '/pic/3.jpg', title: 'Frontend', ru: 'Фронт', label: 'Frontend', state: false, link: '#Frontend',
        txt1: `Это тот кто разрабатывает пользовательскую часть приложения. Кнопки, 
            компоненты, элементы дизайна, анимации, светяшки и свистоперделки, работа с css, html, js это все фронт`,
        txt2: `Мне кажется хороший фронтендер должен уметь дизайнить и должен базово представлять как приложение работает на бэке`,
        txt3: `Warning! Не выбирайте себе специальность по понравившейся картинке! Нейросеть слишком харизматичными всех нарисовала, хотя я просил нарисовать ее хорошо только gamedev-a, 
        потому что на этом курсе самые прикольные уроки!`
    },
    {
        pic: '/pic/9.jpg', title: 'Fullstack', ru: 'Фулстек', label: 'Fullstack', state: false, link: '#Fullstack',
        txt1: `Фулстек - это бэк + фронт. Т.е. тот кто может и на фронте что-то сверстать и на бэке правильно логику приложения продумать и написать. 
            Из моего опыта фулстек - это разработчик который больше бэкендом занимается, т.е. логикой, хранение данных, извлечением,
            преобразованием, передача данных, работа с базами данных, написание АПИ итд`,
        txt2: `Ввиду того что фулстек совмещает в себе несколько специальностей, зарплата его вероятнее всего будет несколько выше чем у программиста с одним направлением.`,
        txt3: `Есть некоторая вероятность что к концу курса у Вас выростет борода как у этого типа на картинке... или Вы облысеете как я...`
    },
    {
        pic: '/pic/fullstack.jpg', title: 'Gamedev', ru: 'Разработчик игр', label: 'Gamedev', state: false, link: '#Gamedev',
        txt1: `Разработка игр. У меня в курсе C# + Unity. Самые отважные из Вас возможно запишутся ко мне на курс, и 
            возможно когда-нибудь я его доделаю и проведу! Но по сравнению с тем что творится в web-е, тут просто ад! Все на порядок сложнее...
             Векторная математика, кватернионы, углы, физика, алгоритмы и другие страшные слова`,
        txt2: `Я неделю пытался объяснить нейросетке что бы она нарисовала мне девчонку без надписей!
            Помойму нейронка пыталась написать что-то вроде "FUCK". Смирился...`,
        txt3: `Те кто верит что ИИ вот вот поработит мир... ИИ не знает как выглядят люди справа, 
            не знает сколько должно быть пальцев у среднестатистического человека, 
            и не может нарисовать девочку без надписей!`
    },
    {
        pic: '/pic/xman3.jpg', title: 'Private', ru: 'Частные уроки', label: 'Private', state: false, link: '#Private',
        txt1: `Могу помогать Вам в частном порядке, если занятия в группе для Вас не подходят. Но я не всесилен и могу помогать только в тех 
            технологиях с которыми сталкивался или представляю как с ними работать`,
        txt2: `1 час - 500 руб. Если что-то сложное мне нужно будет подготовится предварительно, и тогда цена за 1 час - 1000 руб`,
        txt3: `И полностью бесплатно если вдруг Вы изучаете что-то очень интересное, например компьютерное зрение на python и 
            системы распознавания образов - можем вместе поизучать!`
    }
]


// FRONT DATA
let aboutFrontCourse = [
    {field: 'Нужен уровень', value: 'Начинающий'},
    {field: 'Будет уровень', value: 'Jun'},
    {field: 'Сложность', value: '3/10'},
    {field: 'Технология', value: 'VueJs'},
    {field: 'Кол-во занятий', value: '8-15'},
    {field: 'Цена 1 занятия', value: '300 руб.'},
    {field: 'Кол-во глав', value: '3'},
]
let techFrontCourse = ['VueJs', 'JavaScript', 'Ajax/Axios', 'CSS', 'HTML', 'Git']
let descriptionFrontCourse = `Мини курс по Vue. Курс рассчитан на студентов с базовыми знаниями по верстке. Курс с упором на практику по Vue.
В курсе будут использоваться наиболее востребованные и самые часто применимые технологии Vue фреймворка.
Для нормального старта курса
Вам нужно знать базовый HTML, CSS, немного понимать принципы адаптивной верстки. Желательно знать JS на базовом уровне.
Если уже что-то знаете по Vue будет плюсом.
Первые уроки мы повторим все самые важные основы которые обязательно пригодятся далее по курсу.
После начнем проектирование и создание frontend приложения на VueJs.
К концу курса у нас должно будет получится прикольное, яркое, интерактивное резюме фронтенд разработчика,
с некоторым количеством свистоперделок и приятным современным дизайном.
Будет много компонентов, и разбивка приложения на компоненты, будем взаимодействовать с бэкендом. 
Кстати сайт на который Вы прямо сейчас смотрите написан на фронте на Vue. Все темы курса <a class="description-link" href="/frontend"> тут </a>`
let frontCourse = {
    id: 1,
    name: 'Frontend',
    label: 'Frontend Developer',
    about: aboutFrontCourse,
    tech: techFrontCourse,
    description: descriptionFrontCourse
}

// Fullstack DATA
let aboutFullstackCourse = [
    {field: 'Нужен уровень', value: 'Начинающий'},
    {field: 'Будет уровень', value: 'Jun++'},
    {field: 'Сложность', value: '6/10'},
    {field: 'Технология', value: 'Yii2'},
    {field: 'Кол-во занятий', value: '35-55'},
    {field: 'Цена 1 занятия', value: '300 руб.'},
    {field: 'Кол-во глав', value: '7'},
]
let techFullstackCourse = ['PHP', 'Yii2', 'MySQL', 'JS', 'Vue/Jquery', 'CSS', 'HTML', 'Git']
let descriptionFullstackCourse = `Большой курс по Yii2. Yii2 современный и востребованный 
(<a target="_blank" class="description-link" href="https://kostroma.hh.ru/search/vacancy?text=Yii2+php&from=suggest_post&salary=&ored_clusters=true&hhtmFrom=vacancy_search_list&hhtmFromLabel=vacancy_search_line">hh.ru</a>)
PHP фреймворк который позволяет быстро и просто создавать приложения любого уровня.
Курс рассчитан на студентов с базовыми знаниями по PHP. Курс с упором на практику по Yii2.
В курсе будут использоваться наиболее востребованные, важные и самые часто применимые технологии Yii2 фреймворка.
Для нормального старта курса Вам нужно знать PHP или другой язык программирования, хорошо бы знать JS на базовом уровне.
SQL - простые запросы (select, update, insert). Будет круто если Вы понимаете ООП, классы и объекты не вызывают у вас трудностей.
Вам нужно знать базовый HTML, CSS, немного понимать принципы адаптивной верстки.  
Если что-то из этого Вам не знакомо или не понятно, в первых главах курса мы будем поэтапно проходить все эти вещи, 
повторим все самые важные основы которые обязательно пригодятся далее по курсу. После начнем писать клиент-серверное приложение на Yii2.
К концу курса у нас должен будет получится отличный проект - некая навороченная админка с CRUD формами, формами поиска, фильтрации, 
сортировки данных и представлениями всевозможных данных. Возможность запрашивать данные из внешних АПИ(Yandex, Crypto, идр). 
Построение отчетов, графиков и мониторингов идр. Карта курса <a class="description-link" href="/fullstack"> тут </a>`
let fullstackCourse = {
    id: 2,
    name: 'Fullstack',
    label: 'Fullstack Developer',
    about: aboutFullstackCourse,
    tech: techFullstackCourse,
    description: descriptionFullstackCourse,
    warning: {
        type: 'success',
        message: `7 лет опыта в различных компаниях как Фулстек. Хорошо понимаю что нужно учить и что пригодится на работе`
    }
}


// Gamedev DATA
let aboutGamedevCourse = [
    {field: 'Нужен уровень', value: '0'},
    {field: 'Будет уровень', value: 'больше 0'},
    {field: 'Сложность', value: '9/10'},
    {field: 'Технология', value: 'C#'},
    {field: 'Занятий', value: 'много'},
    {field: 'Цена 1 занятия', value: '300 руб.'},
    {field: 'Кол-во глав', value: '6-8'},
]
let techGamedevCourse = ['С#', 'Unity', 'Математика']
let descriptionGamedevCourse = `Большой и наверное самый сложный курс по кодингу на C# (C Sharp) и Unity с упором на написание кода.
 В курсе будет разобрано огромное количество тем. Напишем за 6-10 занятий платформер в стиле "Марио", попутно знакомясь с 
 базовыми навыками в Unity и С#. Потом возьмёмся за более менее серьезный проект: космическую 2D стрелялку с элементами RPG. 
 К концу курса у нас получится 2D игра с процедурно генерируемым миром, с разными типами и классами кораблей, со множеством 
 врагов и союзников обладающими каждый своими характеристиками и ИИ, с посадками на станции, с апгрейдами кораблей и возможностью
  перевозить грузы. Полная карта курса <a class="description-link" href="/gamedev"> тут </a>`
let gamedevCourse = {
    id: 3,
    name: 'Gamedev',
    label: 'Game Developer',
    about: aboutGamedevCourse,
    tech: techGamedevCourse,
    description: descriptionGamedevCourse,
    warning: {
        type: 'warning',
        message: `Я не работал в gameDev-е, поэтому не могу гарантировать востребованность тех знаний что у меня есть по этой теме`
    }
}

export {hello, perc, frontCourse, fullstackCourse, gamedevCourse};